import { Link, Typography } from "@mui/material";
import React from "react";
import { CustomAppBar } from "../Components/MainLayout/AppBar/CustomAppBar";
import ROUTES_NAMES from "../RoutesNames";

export const TermsAndConditionsScreen = () => {
  //if true arabic if false english
  const language =
    window.location.pathname === `/${ROUTES_NAMES.TERMS_AND_CONDITIONS}/ar`
      ? "ar"
      : "en";
  const pageDictionary = {
    ar: {
      title: `شروط الاستخدام
      `,
      welcomeMessage: `مرحبًا بك في URrevs ("URrevs" أو "الموقع") وهو موقع للتواصل الاجتماعي يسمح لمستخدميه بمشاركة مجموعة كبيرة ومتنوعة من المنتجات الإلكترونية الاستهلاكية والتعليق عليها ، إنه ببساطة منصة لعرض مراجعات المستخدمين.

      توفر URrevs خدماتها لك وفقًا لأحكام شروط الخدمة هذه ("TOS").باستخدام هذا الموقع أو عرض المحتوى هنا ، فإنك تقبل وتوافق على الالتزام بهذه الشروط وأحكامها.هذه اتفاقية ملزمة قانونًا بينك وبين URrevs ، لذا يرجى قراءتها بعناية. إذا كنت لا توافق على شروط الخدمة هذه ، فيرجى عدم استخدام URrevs.
      `,
      eligibility: `جدارة الاستخدام
      `,
      eligibilityParagraph: `الا يقل عمر مستخدم الموقع عن ١٨ عاما
      .فاذا تم اكتشاف ان عمر المستخدم اقل من السن القانونى المتفق عليه للاستخدام سيتم حذف حساب المستخدم دون إنذار مسبق
      `,
      yourURrevsAccount: `حساب URrevs الخاص بك
      `,
      yourURrevsAccountParagraph: `من أجل الحصول على تجربة URrevs الكاملة والوصول إلى بعض الميزات على موقع الويب ، سيكون على المستخدم إنشاء حساب مستخدم وملف تعريف.عند إنشاء حساب مستخدم وملف تعريف ، يجب كتابة معلومات كاملة ودقيقة وحقيقيه باستثناء الإسم يسمح باستخدام اسم مستعار، ولا يجوز للمستخدم انتحال شخصية شخص آخر بالاسم او البيانات والا تم حذف حساب المستخدم دون انذار مسبق اذا تم إكتشاف الانتحال 
      يمنع انشاء اكثر من حساب مستخدم لنفس المستخدم 
      
      إذا قمت كمستخدم بإنشاء حساب مستخدم باستخدام URrevs ، فأنت مسؤول عن حماية حسابك وكلمة المرور.أنت توافق على قبول المسؤولية عن جميع الأنشطة التي تحدث فيما يتعلق بحسابك ، سواء كان الاستخدام غير مصرح به أم لا.بالإضافة إلى ذلك ، فإنك توافق على إبلاغنا فورًا بأي استخدام غير مصرح به لحسابك.نحتفظ بالحق في إغلاق حسابك ، وإلغاء اسم المستخدم الخاص بك ، وإزالة أي محتوى مقدم من قبلك في أي وقت ولأي سبب أو بدون سبب. أنت تدرك أن URrevs لن يكون مسؤولاً أمامك عن استدعاء هذا الحق.
      `,
      licenseForPersonalUse: `رخصة الاستخدام الشخصي
      `,
      licenseForPersonalUseParahgraph1: `نحن نمنحك ترخيصًا محدودًا وإذنًا للوصول إلى URrevs واستخدامه الشخصي ولا يوجد اذن او تصريح بتنزيل أو نسخ أي جزء من محتواه لأي غرض تجاري أو لتعديل أي جزء منه ، إلا بموافقتنا الخطية أو المرسلة عبر البريد الإلكتروني.
      لا يتضمن هذا الترخيص أي إعادة بيع أو استخدام تجاري لـ URrevs أو محتواه ؛ أي تجميع أو استخدام "المحتوى الذي ينشئه المستخدم" (كما هو موضح أدناه) ؛ أي استخدام مشتق من URrevs أو محتوياته ؛ أو أي استخدام لاستخراج البيانات أو الروبوتات أو أدوات أو عمليات مماثلة لجمع البيانات أو استخراجها ؛ وأنت توافق على عدم القيام بأي مما سبق. باستثناء ما هو منصوص عليه صراحةً في شروط الاستخدام هذه ، فإنك توافق على عدم تخزين أي شكل من الأشكال أو توزيع أو إرسال أو عرض أو إعادة إنتاج أو تعديل أو إنشاء أعمال مشتقة من أو بيع أو استغلال أي محتوى من أي جزء من URrevs لأي غرض تجاري دون أي موافقة مسبقة من URrevs.
      يجوز لك عرض نسخة واحدة من صفحات URrevs وطباعتها من حين لآخر لاستخدامك الشخصي غير التجاري ، ولكن لا يجوز لك إعادة إنتاج أي مواد تظهر على URrevs (بخلاف "المحتوى الذي ينشئه المستخدم" الخاص بك ، كما هو موضح أدناه) دون موافقة خطية مسبقة منا.يجب إرسال طلبات الحصول على إذن لإعادة إنتاج أو توزيع المواد الموجودة على الموقع إلى 
      `,
      emailAddress: "هذا البريد الإلكتروني.",
      licenseForPersonalUseParahgraph2: `لا يجوز لك استخدام اسمنا أو أي تغيير إملائي أو تباين مطبعي لـ URrevs أو مراجعات المستخدمين ، سواء أكان ذلك بمفرده أو بالاقتران مع أي كلمة أو عبارة أو علامات تجارية أو علامات خدمة أخرى بأي طريقة (بما في ذلك الاستخدام في أي علامات (metatags) أو أي "نص مخفي" آخر) دون استخدام موافقة خطية مسبقة أو بالبريد الإلكتروني.أي انتهاك لما تقدم سوف ينهي الإذن والترخيص الممنوحين من قبلنا للوصول إلى URrevs واستخدامه.      
      `,
      userGeneratedContent: `المحتوى الناتج عن طريق المستخدم
      `,
      userGeneratedContentParagraph: `يجوز لأصحاب حسابات مستخدم URrevs إرسال المحتوى والمعلومات ، بما في ذلك على سبيل المثال لا الحصر ، النص والبيانات والصور ومقاطع الفيديو (يشار إليها مجتمعة "المحتوى الذي ينشئه المستخدم"). أنت تدرك أنه سواء تم نشر أو عدم نشر هذا المحتوى الذي ينشئه المستخدم ، فإن URrevs لا تضمن أي سرية فيما يتعلق بأي محتوى يتم إنشاؤه بواسطة المستخدم.

      أنت توافق على أن المحتوى الذي ينشئه المستخدم والمقصود للعرض على URrevs لن يشمل أي محتوى غير قانوني أو غير لائق أو مدنس (بما في ذلك الألفاظ النابية المقنعة حيث تستخدم الرموز والأحرف الأولى والأخطاء الإملائية المتعمدة أو غيرها من الايحاءات لاي لغة نابية) أو تشهيرية أو منتهكة الخصوصية أو الإضرار بأطراف ثالثة ؛ وأنها لن تتكون من أو تحتوي على فيروسات برمجية أو حملات سياسية أو استدراج تجاري أو رسائل متسلسلة أو رسائل بريدية جماعية أو أي شكل من أشكال "البريد العشوائي". لا يجوز لك استخدام عنوان بريد إلكتروني مزيف أو انتحال شخصية أي شخص أو كيان أو التضليل فيما يتعلق بأصل المحتوى الذي ينشئه المستخدم. بالإضافة إلى القيود الموضحة أعلاه ، لا يجوز لك تقديم المحتوى الذي ينشئه المستخدم ينتهك بأي شكل من الأشكال حقوق الطبع والنشر أو العلامة التجارية أو حقوق الملكية الفكرية الأخرى لأي شخص أو كيان ، أو يحتوي على أي معلومات سرية أو خاصة بأي شخص أو كيان أو ينتهك الحقوق القانونية لأي شخص أو كيان آخر. ستقوم URrevs بإزالة جميع المحتويات التي ينشئها المستخدمون إذا تم إخطارها بشكل صحيح أن هذا المحتوى الذي ينشئه المستخدم ينتهك حقوق الملكية الفكرية للآخرين.
      
      كذلك ، لا يمكنك استخدام URrevs للتهديد أو الملاحقة أو الاحتيال أو التحرش أو المضايقة أو الدعوة إلى مضايقة شخص آخر أو التدخل بطريقة أخرى في استخدام مستخدم آخر لموقع الويب ؛ تشجيع التعصب أو التمييز ضد الطبقات المحمية ؛ نقل أو نشر مواد إباحية أو محتوى غير قانوني ؛ استخدام أي روبوت ، أو عنكبوت برمجي ، أو تطبيق للبحث عن الموقع / تطبيق استرجاعي ، أو أي جهاز آلي آخر ، أو عملية أو وسيلة للوصول إلى موقع الويب أو أي محتوى على URrevs أو استرجاعه أو كشطه أو فهرسته أو نسخه ؛ اتخاذ أي إجراء يفرض أو قد يفرض حمولة كبيرة (ضغط) غير معقولة أو غير متناسبة على البنية التحتية للتكنولوجيا المستخدمة في URrevs ؛ أو تنتهك أي قوانين معمول بها.
      
      أنت وحدك المسؤول و المتحمل عن جميع المخاطر المرتبطة ب المحتوى الذي ينشئه المستخدم الخاص بك. يتضمن ذلك أي اعتماد على دقته أو اكتماله أو فائدته من قِبل الآخرين ، أو أي إفصاح عن المعلومات الموجودة في المحتوى الذي ينشئه المستخدم الخاص بك والذي يجعلك تحدد هويتك الشخصية.أنت تقر بأنك تمتلك أو تملك التراخيص أو الأذونات اللازمة لاستخدامها ، وتخول URrevs استخدام المحتوى الذي ينشئه المستخدم الخاص بك كما هو موضح هنا.
      
      لا تؤيد URrevs أي محتوى ينشئه المستخدم أو أي رأي أو توصية أو مشورة يتم التعبير عنها فيه ، وتتجاهل URrevs بشكل صريح أي وكل مسؤولية فيما يتعلق بالمحتوى الذي ينشئه المستخدم.لا يجوز لك الإشارة إلى أن المحتوى الذي أنشأه المستخدمون يخضع بأي شكل من الأشكال لرعاية أو اعتماد URrevs.
      
      نحن نحتفظ بالحق ، لكننا لسنا ملزمين بمراقبة المحتوى الذي ينشئه المستخدم على URrevs وتقييد أو إزالة المحتوى الذي نعتقد ، حسب تقديرنا الوحيد بأنه غير مناسب.إذا كنت تشعر أن أي محتوى ينشئه المستخدم على URrevs يعد مسيئًا أو ينتهك حقوقك أو شروط الخدمة هذه ، فيرجى مراسلتنا عبر البريد الإلكتروني على 
      `,
      userGeneratedContentParagraph2: ` عَنون الموضوع في البريد الالكتروني: مواد غير لائقة. 
      `,
      licenseToURrevsAndURrevsUsers: `ترخيص لمستخدمي URrevs و ل URrevs
      `,
      licenseToURrevsAndURrevsUsersParagraph: `إنك توافق على أنه ، من خلال نشر أي "المحتوى الذي ينشئه المستخدم" على URrevs ، فإنك تمنح URrevs ترخيصًا عالميًا وغير حصري وخالي من حقوق الملكية ومرخصًا وقابل للتحويل لاستخدام هذا المستخدم وإعادة إنتاجه وتوزيعه وإعداد الأعمال المشتقة منه وعرضه. المحتوى الذي ينشئه المستخدم فيما يتعلق بموقع الويب هذا ونشاطات URrevs (وخلفائها والشركات التابعة لها و الشركات المتعاونة معها) ، بما في ذلك على سبيل المثال لا الحصر الترويج وإعادة توزيع جزء أو كل هذا الموقع (والأعمال المشتقة منه) بأي تنسيقات في الوسائط الاعلامية المختلفة ومن خلال أي قنوات  وسائط (media). أنت تمنحنا أيضًا الحق غير الحصري في السعي إلى الانضمام و / أو الحصول على تعويضات من أي طرف ثالث من الاستخدام غير المصرح به أو إعادة إنتاج المحتوى الذي أنشأه المستخدمون الخاص بك. إذا نشرنا المحتوى الذي ينشئه المستخدم الخاص بك أو أذِنّا أو رخصّنا للآخرين بالقيام بذلك ، فقد يتم تحرير المحتوى الذي ينشئه المستخدم الخاص بك للطول أو الوضوح  أو لأي سبب آخر سواء قبل نشره أو بعده.

    أنت أيضًا بموجب هذا تمنح كل مستخدم لـ URrevs ترخيصًا غير حصري للوصول إلى المحتوى الذي ينشئه المستخدم الخاص بك من خلال موقع الويب ، واستخدام وعرض المحتوى الذي ينشئه المستخدم على النحو المسموح به من خلال وظيفة الموقع الإلكتروني وتحت شروط الخدمة هذه.
    
    يتم إنهاء التراخيص أعلاه الممنوحة بواسطتك في غضون فترة زمنية معقولة تجاريًا بعد إزالة ملف تعريف المستخدم الخاص بك أو حذفه أو إنهاء حساب المستخدم الخاص بك. ومع ذلك ، فإنك تدرك وتوافق على أنه يجوز لـ URrevs الاحتفاظ بنسخ الخادم من هذا المحتوى الذي ينشئه المستخدم أو حذفه أو عدم توزيعه. تعتبر التراخيص أعلاه الممنوحة من قِبلك فيما يتعلق منشورات المحتوى الذي ينشئه المستخدم الخاص بك والتي تمت مشاركتها مع الآخرين ، على سبيل المثال لا الحصر ، التعليقات علي المناقشات او المراجعات أو المنتجات التي أصبحت جزءًا من قاعدة بيانات URrevs ، دائمة وغير قابلة للإلغاء.
     `,
      urrevssUseOfUserGeneratedContent: `استخدام URrevs للمحتوى الذي ينشئه المستخدم
      `,
      urrevssUseOfUserGeneratedContentParagraph: `قد تستخدم URrevs أو لا تستخدم المحتوى الذي ينشئه المستخدم الخاص بك وفقًا لتقديرها الخاص. على سبيل المثال ، قد نختار عدم نشر المحتوى الذي ينشئه المستخدم الخاص بك إذا اعتقدنا أنه ينتهك شروط الخدمة. بالإضافة إلى ذلك ، يرجى ملاحظة أنه ليس علينا أي التزام بالاحتفاظ بنسخ من المحتوى الذي ينشئه المستخدم الخاص بك أو تزويدك بنسخ منها ، ولا نضمن أي سرية فيما يتعلق ب المحتوى الذي ينشئه المستخدم الخاص بك.

      قد تعرض URrevs وأصحاب التراخيص الخاصة بها الإعلانات وغيرها من المعلومات المجاورة أو المضمنة مع المحتوى الذي ينشئه المستخدم الخاص بك على الموقع الإلكتروني والوسائط (media) الأخرى. لا يحق لك الحصول على أي تعويض عن هذه الإعلانات. تخضع طريقة وكيفية و أسلوب ومدى هذا الإعلان للتغيير دون إشعار محدد لك.
      `,
      privacyPolicy: `سياسة الخصوصية
      `,
      privacyPolicyParagraph: `سياسة الخصوصية الحالية لـ URrevs متاحة على `,
      thisLink: ` هذا الرابط`,
      privacyPolicyParagraph2: ` ويتم تضمينها في هذا المرجع.
      `,
      linksToThirdPartyWebsites: `روابط لمواقع الطرف الثالث
      `,
      linksToThirdPartyWebsitesParagraph: `د يتضمن URrevs روابط إلى مواقع ويب أخرى كجزء من المحتوى الذي تم إنشاؤه بواسطة URrevs ("محتوى URrevs") أو المحتوى الذي ينشئه المستخدم. لا يتحكم URrevs أو يقر أي محتوى من مواقع الأطراف الثالثة هذه ، وبواسطة استخدام URrevs ، فإنك توافق على أن URrevs غير مسؤول عن توفر أو محتوى هذه المواقع الإلكترونية للأطراف الثالثة.
      `,
      termination: `الإنهاء
      `,
      terminationParagraph: `تحتفظ URrevs بالحق ، وفقًا لتقديرها الخاص ، في تقييد أو تعليق أو إنهاء وصولك إلى كل أو جزء من الموقع في أي وقت ، بما في ذلك إلغاء اسم المستخدم الخاص بك ، لأي سبب أو بدون سبب ، مع أو بدون إشعار مسبق ، ودون مسؤولية. تحتفظ URrevs صراحة بالحق في إزالة حساب المستخدم الخاص بك و / أو تقييد حسابك أو تعليقه أو إنهائه ووصولك إلى أي جزء من موقع الويب إذا كان يحدد ، وفقًا لتقديرهأ الخاص ، على سبيل المثال ، أنك انتهكت شروط الخدمة أو كنت مشتبهًا بها التورط في نشاط غير قانوني.

      يمكنك إنهاء حسابك مع URrevs في أي وقت ، ولأي سبب ، عن طريق التواصل معنا.
      
      في حالة حدوث أي إنهاء ، تظل شروط الخدمة هذه سارية.
      `,
      ownership: `الملكية
      `,
      ownershipParagraph: `يمتلك URrevs محتوى URrevs المتوفر على موقع الويب ، بما في ذلك على سبيل المثال لا الحصر ، الواجهات البصرية والميزات التفاعلية والرسومات والبرامج النصية والصور والأصوات والموسيقى ومقاطع الفيديو والتصميم والتجميع ورمز الكمبيوتر والمنتجات والبرمجيات والنص والتجميع لتقييمات مراجعات المستخدم ، وجميع العناصر والمكونات الأخرى للموقع و المحتوى الذي ينشئه المستخدم ، باستثناء أي محتوى تابع لجهة خارجية. تمتلك URrevs أيضًا أو تمتلك ترخيصًا لحقوق التأليف والنشر والعلامات التجارية وعلامات الخدمة والأسماء التجارية وغيرها من الحقوق الفكرية وحقوق الملكية في جميع أنحاء العالم المرتبطة بمحتوى URrevs والموقع الإلكتروني ، وهي محمية بموجب حقوق الطبع والنشر واللباس التجاري وبراءات الاختراع والعلامات التجارية. وجميع الحقوق والقوانين الفكرية والملكية السارية. على هذا النحو ، لا يجوز لك تعديل أو إعادة إنتاج أو توزيع أو إنشاء أعمال أو اشتقاقات مشتقة أو عرض أي محتوى من محتوى URrevs كليًا أو جزئيًا بأي شكل أو جزء منه باستثناء ما هو مخول صراحة من URrevs.باستثناء ما هو منصوص عليه صراحة وبلا لبس فيه ، لا يمنحك URrevs أي حقوق صريحة أو ضمنية. يتم الاحتفاظ بجميع الحقوق في وإلى موقع الويب ومحتوى URrevs بواسطة URrevs.
      `,
      copyrightPolicy: `سياسة حقوق النشر
      `,
      copyrightPolicyParagraph: `لا يجوز لك نشر أو تعديل أو توزيع أو إعادة إنتاج بأي شكل من الأشكال أي مواد أو علامات تجارية أو حقوق ملكية خاصة بحقوق الطبع والنشر تعود ملكيتها للآخرين دون الحصول على موافقة كتابية مسبقة من مالك حقوق الملكية هذه. تقضي سياسة URrevs بإنهاء حساب مستخدم وامتيازات أي مستخدم ل URrevs ينتهك بشكل متكرر حقوق الطبع والنشر للآخرين عند استلام إشعار مناسب إلى URrevs بواسطة مالك حقوق الطبع والنشر أو الوكيل القانوني لمالك حقوق الطبع والنشر. وفقًا لقانون حقوق النشر الرقمية للألفية ، إذا كنت تعتقد أن أيًا من المحتويات التي أنشأها المستخدمون في URrevs أو أي محتوى آخر ينتهك حقوق الطبع والنشر الخاصة بك ، فيرجى تزويد وكيل حقوق الطبع والنشر لدينا بالمعلومات التالية: (1) توقيع إلكتروني أو مادي للشخص المفوض بالتصرف نيابة عن مالك حقوق الطبع والنشر ؛ (2) وصف العمل المحمي بحقوق الطبع والنشر الذي تدعي أنه تم انتهاكه ؛ (3) وصفًا لمكان وجود المادة التي تدعي أنها تمثل انتهاكًا لها في URrevs ؛ (4) عنوانك ورقم هاتفك وعنوان بريدك الإلكتروني ؛ (5) بيان مكتوب من جانبك بأن لديك اعتقاد حسن النية بأن الاستخدام المتنازع عليه غير مصرح به من قبل مالك حقوق الطبع والنشر أو وكيله أو القانون ؛ (6) بيانًا من جانبك ، تم إصداره بموجب عقوبة الحنث باليمين ، بأن المعلومات الواردة أعلاه في إشعارك دقيقة وأنك مالك حقوق الطبع والنشر أو مصرح لك بالتصرف نيابة عن مالك حقوق الطبع والنشر.يمكن الوصول إلى وكيل حقوق الطبع والنشر في URrevs للإشعار بمزاعم انتهاك حقوق الطبع والنشر على النحو التالي: عن طريق إرسال بريد إلكتروني إلى`,
      warrantyDisclaimers: `إخلاء مسؤولية الضمان
      `,
      warrantyDisclaimersParagraph: `يتم توفير جميع المواد والمعلومات والبرامج والمنتجات والخدمات المدرجة أو المتوفرة من خلال URrevs كما هي "و" كما هي متوفرة "للاستخدام الخاص بك. يتم توفير جميع المواد والمعلومات والبرامج والمنتجات والخدمات المضمنة في أو من خلال هذا الموقع دون ضمانات من أي نوع ، سواء كانت صريحة أو ضمنية ، بما في ذلك ، على سبيل المثال لا الحصر ، ضمانات ضمنية أو الضمانات الخاصة بالتسويق ، الملاءمة لغرض معين أو غير المخالفة.نحن والكيانات الأخرى من ما نحصل عليه لا نضمن أن المواد أو المعلومات أو البرامج أو المنتجات أو الخدمات المدرجة في URrevs دقيقة أو موثوقة أو صحيحة ؛ أو أن URrevs ستكون متوفرة في أي وقت أو موقع محددين ؛أو أنه سيتم تصحيح أي عيوب أو أخطاء ؛ أو أن URrevs يخلو من أي فيروسات أو مكونات ضارة أخرى.استخدامك لهذا الموقع هو وحدك على مسؤوليتك. نظرًا لأن بعض الولايات القضائية لا تسمح باستثناء بعض الضمانات ، فقد لا تنطبق هذه الاستبعادات عليك.`,
      limitationOfLiability: `تحديد المسؤولية
      `,
      limitationOfLiabilityParagraph: `تحت أي ظرف من الظروف ، لن نتحمل نحن أو أي من الشركات التي نعمل بها معها مسؤولية أي أضرار مباشرة أو غير مباشرة أو عدوانية أو عرضية أو خاصة أو تبعية ناتجة عن استخدام أو عدم القدرة على استخدام URrevs. ينطبق هذا القيد على أن المسؤولية المزعومة تستند إلى عقد أو ضرر أو إهمال أو مسؤولية صارمة أو أي أساس آخر ، حتى إذا تم إخطارنا باحتمالية حدوث مثل هذا الضرر وتحت أي ظرف من الظروف التي تسبب أي علاج حصري بموجب هذه الاتفاقية تؤدي إلى فشل غرضها الأساسي.

      أنت تقر بشكل خاص بأن URrevs لن تكون مسؤولة عن أفعال المستخدمين أو السلوك التعسفي أو غير القانوني لأي سلوك من طرف ثالث ومخاطر الضرر أو الضرر الناجم عن القرارات السابقة وأن خطر الإضرار أو الضرر الناجم عن ما تقدم يقع لك تمامًا.
      نظرًا لأن بعض الولايات القضائية لا تسمح باستثناء أو الحد من الأضرار العرضية أو التبعية ، فإن مسؤوليتنا في هذه الولايات القضائية تكون محدودة بالقدر الذي يسمح به القانون. 
      `,
      damagesIndemnification: `الأضرار. التعويض
      `,
      damagesIndemnificationParagraph: `أنت توافق على أنك ستكون مسؤولاً عن أي أضرار ناتجة عن أي انتهاك لشروط الخدمة هذه. أنت توافق أيضًا على تعويض URrevs وحجزه ، ومالكيها والشركات التابعة لها والمسؤولين والمديرين والوكلاء والموظفين ،URrevs غير مُضارة من أي مطالبة أو طلب ، بما في ذلك أتعاب المحاماة المعقولة ، التي يقدمها أي طرف ثالث بسبب أو الناشئة عن خرقك لـ شروط الخدمة هذه ، أو أي انتهاك لأي قانون أو حقوق أي طرف ثالث يحدث فيما يتعلق باستخدامك لـ URrevs.
      `,
      choiceOfLawAndForum: `اختيار القانون والمحكمة
      `,
      choiceOfLawAndForumParagraph: `تخضع شروط الخدمة هذه وتفسر وفقًا لقوانين الدولة المصرية ، باستثناء قواعد تنازع القوانين. أنت توافق على أنه ، ما لم نتنازل صراحةً ، فإن الاختصاص الحصري لأي مطالبة أو إجراء ينشأ عن أو يتعلق بهذه الشروط أو استخدامك لـ URrevs سيكون في المحاكم الموجودة في القاهرة ، مصر وتوافق كذلك على الخضوع لممارسة الاختصاص الشخصي لمثل هذه المحاكم لغرض التقاضي بشأن أي دعوى أو إجراء من هذا القبيل. أنت توافق على تلقي خدمة العملية او الإخطار من خلال البريد الإلكتروني أو البريد المعتمد أو بوسائل أخرى يقرها القانون ، وأنت تتنازل صراحة عن أي ادعاء بوجود مكان غير لائق وأي ادعاء بأن هذه المحاكم هي منتدى غير مريح. أنت توافق أيضًا على أنه في حالة اتخاذ أي إجراء لتطبيق أو تفسير هذه الشروط والأحكام ، يحق للطرف السائد تحصيل أتعاب المحاماة المعقولة.
      `,
      modificationAndSeverability: `التعديل والصلاحية
      `,
      modificationAndSeverabilityParagraph: `تحتفظ URrevs بالحق في إجراء تغييرات على شروط الخدمة هذه وإشعاراتنا القانونية الأخرى فى اى وقت ودون انتظار موافقة من اى مستخدم مع نشر التغييرات الجديدة وتعريف المستخدم بها . ومن خلال الاستمرار في استخدام هذا الموقع الإلكتروني بعد نشرنا لهذه التغييرات ، فإن المستخدم يعد موافق عليها ضمنيا دون اى اعتراض . ويجوز لنا تغيير أو تقييد الوصول إلى URrevs أو تعليقه أو إيقافه أو أي جزء منه في أي وقت.
      `,
      miscellaneous: `متنوع
      `,
      miscellaneousParagraph: `أنت و URrevs كيانان مستقلان ، ولا شيء في شروط الخدمة هذه ، أو عن طريق استخدام الموقع الإلكتروني ، سيخلق أي شراكة أو مشروع مشترك أو وكالة أو امتياز أو مندوب مبيعات أو علاقة عمل بين URrevs و بينك. لا يجوز لك نقل أو التنازل عن أي حقوق أو تراخيص ممنوحة بموجب شروط الخدمة هذه ، ولكن قد يتم التنازل عنها بواسطة URrevs دون قيود. إذا اعتبر أي بند من أحكام شروط الخدمة هذه باطلاً أو فاسدة أو لاغية أو غير قابل للتنفيذ لأي سبب آخر ، فيُعتبر هذا الحكم قابلاً للفصل ولا يؤثر على صلاحية وقابلية تنفيذ توازن شروط الخدمة هذه. لا يعني فشل URrevs في ممارسة أو إنفاذ أي حق أو حكم من أحكام شروط الخدمة هذه كتنازل عن هذا الحق أو الحكم. عناوين الأقسام في شروط الخدمة هذه هي للراحة فقط وليس لها أي تأثير قانوني أو تعاقدي. تعمل شروط الخدمة هذه إلى أقصى حد يسمح به القانون.
      إذا كان لديك أي أسئلة بخصوص شروط الخدمة هذه ، فيرجى الاتصال بنا على 
      `,
      iHaveReadTheAgreement: `لقد قرأت هذا الاتفاق وأوافق على جميع الأحكام الواردة أعلاه.
      `,
    },
    en: {
      title: ``,
      welcomeMessage: ``,
      eligibility: ``,
      eligibilityParagraph: ``,
      yourURrevsAccount: ``,
      yourURrevsAccountParagraph: ``,
      licenseForPersonalUse: ``,
      licenseForPersonalUseParahgraph1: ``,
      emailAddress: ``,
      licenseForPersonalUseParahgraph2: ``,
      userGeneratedContent: ``,
      userGeneratedContentParagraph: ``,
      userGeneratedContentParagraph2: ``,
      licenseToURrevsAndURrevsUsers: ``,
      licenseToURrevsAndURrevsUsersParagraph: ``,
      urrevssUseOfUserGeneratedContent: ``,
      urrevssUseOfUserGeneratedContentParagraph: ``,
      privacyPolicy: ``,
      privacyPolicyParagraph: ``,
      thisLink: ``,
      privacyPolicyParagraph2: ``,
      linksToThirdPartyWebsites: ``,
      linksToThirdPartyWebsitesParagraph: ``,
      termination: ``,
      terminationParagraph: ``,
      ownership: ``,
      ownershipParagraph: ``,
      copyrightPolicy: ``,
      copyrightPolicyParagraph: ``,
      warrantyDisclaimers: ``,
      warrantyDisclaimersParagraph: ``,
      limitationOfLiability: ``,
      limitationOfLiabilityParagraph: ``,
      damagesIndemnification: ``,
      damagesIndemnificationParagraph: ``,
      choiceOfLawAndForum: ``,
      choiceOfLawAndForumParagraph: ``,
      modificationAndSeverability: ``,
      modificationAndSeverabilityParagraph: ``,
      miscellaneous: ``,
      miscellaneousParagraph: ``,
      iHaveReadTheAgreement: ``,
    },
  };
  const headerStyling = "S18W500C050505";
  const subHeaderStyling = "";
  return (
    <CustomAppBar label={pageDictionary[language].title} showLabel showBackBtn>
      <div
        style={{
          whiteSpace: "pre-line",
        }}
      >
        {/* Welcome Message */}
        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].welcomeMessage}
        </Typography>

        {/* Eligibility Section */}
        <Typography variant={headerStyling}>
          {pageDictionary[language].eligibility}
        </Typography>
        <Typography>{pageDictionary[language].eligibilityParagraph}</Typography>

        {/* Your URrevs Account Section */}
        <Typography variant={headerStyling}>
          {pageDictionary[language].yourURrevsAccount}
        </Typography>

        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].yourURrevsAccountParagraph}
        </Typography>

        {/* License For Personal Use Section */}
        <Typography variant={headerStyling}>
          {pageDictionary[language].licenseForPersonalUse}
        </Typography>

        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].licenseForPersonalUseParahgraph1}
          <Link href="mailto: urrevsofficial@gmail.com" underline="always">
            {pageDictionary[language].emailAddress}
          </Link>
        </Typography>

        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].licenseForPersonalUseParahgraph2}
        </Typography>

        {/* User Generated Content*/}
        <Typography variant={headerStyling}>
          {pageDictionary[language].userGeneratedContent}
        </Typography>

        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].userGeneratedContentParagraph}
          <Link href="mailto: urrevsofficial@gmail.com" underline="always">
            {pageDictionary[language].emailAddress}
          </Link>
          {pageDictionary[language].userGeneratedContentParagraph2}
        </Typography>

        {/* licenseToURrevsAndURrevsUsers Section */}
        <Typography variant={headerStyling}>
          {pageDictionary[language].licenseToURrevsAndURrevsUsers}
        </Typography>

        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].licenseToURrevsAndURrevsUsersParagraph}
        </Typography>

        {/* urrevssUseOfUserGeneratedContent section */}
        <Typography variant={headerStyling}>
          {pageDictionary[language].urrevssUseOfUserGeneratedContent}
        </Typography>

        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].urrevssUseOfUserGeneratedContentParagraph}
        </Typography>

        {/*  privacyPolicy section*/}
        <Typography variant={headerStyling}>
          {pageDictionary[language].privacyPolicy}
        </Typography>
        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].privacyPolicyParagraph}
          <Link
            to={`/${ROUTES_NAMES.PRIVACY_POLICY / { language }}`}
            underline="always"
          >
            {pageDictionary[language].thisLink}
          </Link>
          <Typography variant={subHeaderStyling}>
            {pageDictionary[language].privacyPolicyParagraph2}
          </Typography>
        </Typography>

        {/*  linksToThirdPartyWebsites section */}
        <Typography variant={headerStyling}>
          {pageDictionary[language].linksToThirdPartyWebsites}
        </Typography>
        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].linksToThirdPartyWebsitesParagraph}
        </Typography>
        {/* termination section */}
        <Typography variant={headerStyling}>
          {pageDictionary[language].termination}
        </Typography>
        <Typography variant={subHeaderStyling}>
          {pageDictionary[language].terminationParagraph}
        </Typography>
      </div>
    </CustomAppBar>
  );
};
